ruby-files/app/controllers/feedbacks_controller.rb

  def index
    @feedbacks = Feedback.all
---
SELECT "feedbacks".* FROM "feedbacks"

  def create
    @feedback = Feedback.new(feedback_params)

    respond_to do |format|
      if @feedback.save
---
INSERT INTO "feedbacks" ("feedback_id", "situation", "action", "impact_id", "anonymous", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @feedback.update(feedback_params)
---
UPDATE "feedbacks" SET "feedback_id" = ?, "situation" = ?, "action" = ?, "impact_id" = ?, "anonymous" = ?, "updated_at" = ? WHERE "feedbacks"."id" = ?  [["feedback_id", 123], ["situation", "When I saw you today"], ["action", "You smiled"], ["impact_id", 5], ["anonymous", 1], ["updated_at", "2018-11-01 16:06:27.698368"], ["id", 1]]

    def set_feedback
      @feedback = Feedback.find(params[:id])
---
SELECT  "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]