ruby-files/app/models/feedback.rb

SELECT "feedbacks".* FROM "feedbacks"
---
def write_json
  Feedback.all.each do |feedback|